robMarcoPolo/vibepulse/sdkconfig.defaults
# Startvärden för targetbygget. Flash-, PSRAM- och CPU-raderna är hämtade ur
# Waveshares egen demo (spec/hardware.md): kortet har oktal-PSRAM som måste
# klockas rätt, annars startar panelen inte alls.
CONFIG_IDF_TARGET="esp32s3"

# 16 MB QIO-flash
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# En ny OTA-avbild måste klara Torgets lokala hälsogrind vid första boot;
# tills den godkänts kan bootloadern rulla tillbaka till förra luckan.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# 8 MB oktal-PSRAM med XIP: LVGL:s ritbuffertar (480x50 dubbelbuffrat) bor här
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
# (2026-08-16: prövade CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP för att lätta det
# interna heapet — gjorde det VÄRRE, min-fritt föll till 16 byte och LVGL-tasken
# fastnade i låst render. Reverterat. Roten är LVGL:s 96 KB-pool i internt BSS;
# rätt fix mäts fram i diag-heartbeaten innan den sätts.)

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# --- Diagnostik: pinnat med flit, inte ärvt (OBS-02, OBS-28, OBS-35) ---
# En panik sparar en ELF-coredump i flashpartitionen "coredump" innan
# omstarten, så en nattlig krasch går att läsa nästa morgon med
# `idf.py coredump-info` i stället för att kräva en inkopplad monitor i
# just den sekunden. Bootbanderollen säger till när en dump ligger där.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
# Panik = skriv ut, dumpa, starta om. Det är IDF:s default; det står här så
# en IDF-bump inte tyst byter till "stanna och vänta på debuggern" på en
# skärm som ska hänga på en hylla utan dator.
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
# Loggnivå INFO, och maxnivån LIKA MED defaultnivån: då kompileras ESP_LOGD
# bort helt. Det är inte bara brus: ESP-IDF:s HTTP_CLIENT-tagg skriver hela
# förfrågningsraden vid DEBUG, och reläets URL-sökväg är en hemlighet
# (docs/relay.md, OBS-35). Vill någon ha DEBUG på ett relä-bygge måste
# den taggen klämmas med esp_log_level_set("HTTP_CLIENT", ESP_LOG_INFO).
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y
# Taskvakthunden: IDF:s default (på, 5 s, varnar utan panik), pinnat så
# valet är synligt. Vilka tasker som faktiskt prenumererar är OBS-17.
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
# Uttryckligen AV: vakthunden varnar, den startar inte om panelen
# (docs/observability.md lovar det; CMake-vakten vägrar ett gammalt
# sdkconfig som har den på).
# CONFIG_ESP_TASK_WDT_PANIC is not set
# Vakthunden vaktar bara IDLE-taskerna (ingen egen task prenumererar,
# OBS-17) — utan de här två vaktar den ingenting alls.
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
# LVGL:s egen logg på WARN via printf: starterns enda rapport när en app
# hoppas över för API-versionsmiss (platform/torget_ui.c) gick förut till
# en avstängd logg och försvann.
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
CONFIG_LV_LOG_PRINTF=y

# LVGL: bara de widgets UI:t faktiskt använder. Montserrat 14 finns kvar som
# LV_FONT_DEFAULT — våra Plex-fonter sätts explicit på varje etikett, men
# LVGL vill ha en defaultfont som existerar.
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_SPAN=y
CONFIG_LV_USE_TILEVIEW=y
CONFIG_LV_USE_QRCODE=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_DEF_REFR_PERIOD=15

# HTTPS mot solelkollen.se via certifikatbunten: ingen pinning att underhålla,
# överlever certrotation (beslutsloggen i README).
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# Vibbes USB/audio-tasker behöver internminnet och mbedTLS behöver ungefär
# 42 kB per HTTPS-anslutning. Lägg därför TLS-allokeringarna i kortets 8 MB
# PSRAM; annars saknar Solelkollen ett sammanhängande block efter Vibbe-init.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# Nätverkstacken får jobba på: en hämtning var 30:e sekund är ingen last, men
# en blockerad TLS-handskakning ska inte svälta LVGL-tasken.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
# LVGL-poolen: 256 KB nu när den bor i PSRAM (frysfix 2026-08-16, se
# rot-CMakeLists + main/lv_psram_pool.c). Rymligt eftersom PSRAM har 6,4 MB;
# ger Needs You-takeovern + GitHub-sidan + alla appar gott om objektutrymme
# utan att röra det interna heapet där panelflushens DMA-buffert bor.
# LVGL 9.6 döpte om poolknappen: LV_MEM_SIZE_KILOBYTES är DEPRECATED och
# läses inte längre, medan LV_MEM_SIZE (BYTES) styr på riktigt. Den gamla
# raden ensam lät poolen falla tillbaka på LVGL:s egen 64 KiB-default —
# panelen wedgade i lv_obj_class_create_obj's OOM-assert när WiFi-setupens
# 196x196 QR-canvas skulle ritas (mätt på hårdvara 2026-09-16). Båda sätts
# till samma 256 KiB så att bygget är rätt oavsett vilken LVGL 9.x som löses.
CONFIG_LV_MEM_SIZE=262144
CONFIG_LV_MEM_SIZE_KILOBYTES=256

# --- Vibbe (app_buddy) --- USB-ljudkortsläget. Parametrarna bor i Kconfig,
# inte i uac_device_config_t (bänkläxa 2026-08-07: default är 48 kHz medan
# hela ljudnavet antar 16 kHz, och utan macOS-flaggan blir feedback-formatet
# fel med hackigt ljud som symptom).
CONFIG_UAC_SAMPLE_RATE=16000
CONFIG_UAC_SUPPORT_MACOS=y
CONFIG_UAC_TUSB_PRODUCT="Vibbe"
